<template>
  <div class="aboutPage">
    <h1>Тестовое задание SquareGPS</h1>
    <p>Необходимо с помощью Vuejs, Vuex, VueRouter, Vuetify написать приложение. Хэдер приложения должен содержать меню из 2-х пунктов:</p>
    <p>В основной части приложения должно отображаться содержимое разделов.</p>
    <h2>Раздел "О Задании"</h2>
    <p>В разделе должен быть текст этого задания, сверстанный аналогично.</p>
    <h2>Раздел "Карта"</h2>
    <p>На экране должны быть карта и список (см пример):</p>
    <span>1. При клике на кнопку добавления, карта должна перейти в режим добавления маркера: в месте клика должен появится маркер, а в списке - запись с адресом точки</span><br/>
    <p>Для поиска адреса можно использовать любое бесплатное API для геокодирования, например: <a>https://geocode.maps.co/</a></p>
    <p>В случае, если адрес не найден, необходимо вывести ошибку и не добавлять маркер в список.</p>
    <span>2. При клике на маркер должна подсвечиваться запись в списке</span><br/>
    <span>3. При клике на запись в списке карта должна центрироваться на маркере</span><br/>
    <span>4. Маркеры должны храниться локально и не пропадать после перезагрузки страницы</span><br/>
    <p>5. В адресной строке должен отображаться id выбранного маркера</p>
    <p>Локальное хранение данных должно быть организовано в виде сервиса, эмулирующего бекенд. (Необходим класс Backend, который псевдо-асинхронно сохраняет данные в localStorage)</p>
    <p><b>Дополнительно:</b></p>
    <span>1. Продумать отображение на мобильных устройствах</span><br/>
    <span>2. Предусмотреть локализацию</span><br/>
    <span>3. Необходимо с помощью jest написть 1 модульный тест на любой компонент</span><br/><br/>
    <p><b>Напоминание:</b> тестовое задание призвано показать умение писать хороший модульный код, а также умение пользоваться указанными технологиями и не только. Этим кодом нужно гордиться.</p>
  </div>
</template>

<script>

export default {
  name: 'AboutPage',
  components: {
  }
}
</script>

<style scoped>
.aboutPage {
  margin: 16px;
}
</style>
